---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.HvacFailures.PanelDoesntMatchCircuitPropertiesDisconnected
source: html/623ab858-69e5-6c57-5c67-58f2daee2002.htm
---
# Autodesk.Revit.DB.BuiltInFailures.HvacFailures.PanelDoesntMatchCircuitPropertiesDisconnected Property

The panel no longer matches the properties for the Circuit. Disconnect the panel from the Circuit?

## Syntax (C#)
```csharp
public static FailureDefinitionId PanelDoesntMatchCircuitPropertiesDisconnected { get; }
```